In [98]:
import numpy as np
import pandas as pd

In [5]:
df=pd.read_csv("C:/Users/Bora/Desktop/persona.csv")

In [12]:
df["SOURCE"].unique()

array(['android', 'ios'], dtype=object)

In [14]:
df.groupby("SOURCE")["SOURCE"].count()

SOURCE
android    2974
ios        2026
Name: SOURCE, dtype: int64

In [16]:
len(df["PRICE"].unique())

6

In [17]:
df.groupby("PRICE")["PRICE"].count()

PRICE
9      200
19     992
29    1305
39    1260
49    1031
59     212
Name: PRICE, dtype: int64

In [18]:
df.groupby("COUNTRY")["COUNTRY"].count()

COUNTRY
bra    1496
can     230
deu     455
fra     303
tur     451
usa    2065
Name: COUNTRY, dtype: int64

In [19]:
df.groupby("COUNTRY")["PRICE"].sum()

COUNTRY
bra    51354
can     7730
deu    15485
fra    10177
tur    15689
usa    70225
Name: PRICE, dtype: int64

In [20]:
df.groupby("SOURCE")["SOURCE"].count()

SOURCE
android    2974
ios        2026
Name: SOURCE, dtype: int64

In [21]:
df.groupby("COUNTRY")["PRICE"].mean()

COUNTRY
bra    34.327540
can    33.608696
deu    34.032967
fra    33.587459
tur    34.787140
usa    34.007264
Name: PRICE, dtype: float64

In [22]:
df.groupby("SOURCE")["PRICE"].mean()

SOURCE
android    34.174849
ios        34.069102
Name: PRICE, dtype: float64

In [23]:
df.groupby(["COUNTRY","SOURCE"])["PRICE"].mean()

COUNTRY  SOURCE
bra      android    34.387029
         ios        34.222222
can      android    33.330709
         ios        33.951456
deu      android    33.869888
         ios        34.268817
fra      android    34.312500
         ios        32.776224
tur      android    36.229437
         ios        33.272727
usa      android    33.760357
         ios        34.371703
Name: PRICE, dtype: float64

In [31]:
agg_df=pd.DataFrame(df.groupby(["COUNTRY","SOURCE","SEX","AGE"])["PRICE"].mean().sort_values(ascending=False))

In [36]:
agg_df=agg_df.reset_index()

In [37]:
agg_df

    COUNTRY   SOURCE     SEX  AGE  PRICE
0       bra  android    male   46   59.0
1       usa  android    male   36   59.0
2       fra  android  female   24   59.0
3       usa      ios    male   32   54.0
4       deu  android  female   36   49.0
..      ...      ...     ...  ...    ...
343     usa      ios  female   38   19.0
344     usa      ios  female   30   19.0
345     can  android  female   27   19.0
346     fra  android    male   18   19.0
347     deu  android    male   26    9.0

[348 rows x 5 columns]

In [71]:
agg_df["AGE_CAT"]=agg_df["AGE"].astype("category")

In [74]:
agg_df["AGE_CAT"]=pd.cut(agg_df.AGE,bins=[0,18,23,30,40,70],labels=['0-18','19-23','24-30','31-40','41-70'])
agg_df

    COUNTRY   SOURCE     SEX  AGE  PRICE AGE_CAT
0       bra  android    male   46   59.0   41-70
1       usa  android    male   36   59.0   31-40
2       fra  android  female   24   59.0   24-30
3       usa      ios    male   32   54.0   31-40
4       deu  android  female   36   49.0   31-40
..      ...      ...     ...  ...    ...     ...
343     usa      ios  female   38   19.0   31-40
344     usa      ios  female   30   19.0   24-30
345     can  android  female   27   19.0   24-30
346     fra  android    male   18   19.0    0-18
347     deu  android    male   26    9.0   24-30

[348 rows x 6 columns]

In [75]:
agg_df["AGE_CAT"]=agg_df["AGE_CAT"].astype("string")
agg_df

    COUNTRY   SOURCE     SEX  AGE  PRICE AGE_CAT
0       bra  android    male   46   59.0   41-70
1       usa  android    male   36   59.0   31-40
2       fra  android  female   24   59.0   24-30
3       usa      ios    male   32   54.0   31-40
4       deu  android  female   36   49.0   31-40
..      ...      ...     ...  ...    ...     ...
343     usa      ios  female   38   19.0   31-40
344     usa      ios  female   30   19.0   24-30
345     can  android  female   27   19.0   24-30
346     fra  android    male   18   19.0    0-18
347     deu  android    male   26    9.0   24-30

[348 rows x 6 columns]

In [76]:
index1=agg_df["COUNTRY"]+"_"+agg_df["SOURCE"]+"_"+agg_df["SEX"]+"_"+agg_df["AGE_CAT"]
index1

0        bra_android_male_41-70
1        usa_android_male_31-40
2      fra_android_female_24-30
3            usa_ios_male_31-40
4      deu_android_female_31-40
                 ...
343        usa_ios_female_31-40
344        usa_ios_female_24-30
345    can_android_female_24-30
346       fra_android_male_0-18
347      deu_android_male_24-30
Length: 348, dtype: string

In [85]:
df1={'customers_level_based':index1,'PRICE':agg_df["PRICE"]}
df1=pd.DataFrame(df1)
df1.reset_index()
df1

        customers_level_based  PRICE
0      bra_android_male_41-70   59.0
1      usa_android_male_31-40   59.0
2    fra_android_female_24-30   59.0
3          usa_ios_male_31-40   54.0
4    deu_android_female_31-40   49.0
..                        ...    ...
343      usa_ios_female_31-40   19.0
344      usa_ios_female_24-30   19.0
345  can_android_female_24-30   19.0
346     fra_android_male_0-18   19.0
347    deu_android_male_24-30    9.0

[348 rows x 2 columns]

In [86]:
df1=pd.DataFrame(df1.groupby("customers_level_based")["PRICE"].mean())
df1

                              PRICE
customers_level_based
bra_android_female_0-18   35.645303
bra_android_female_19-23  34.077340
bra_android_female_24-30  33.863946
bra_android_female_31-40  34.898326
bra_android_female_41-70  36.737179
...                             ...
usa_ios_male_0-18         33.983495
usa_ios_male_19-23        34.901872
usa_ios_male_24-30        34.838143
usa_ios_male_31-40        36.206324
usa_ios_male_41-70        35.750000

[109 rows x 1 columns]

In [91]:
agg_df["SEGMENT"]=pd.qcut(agg_df["PRICE"],4,labels=["D","C","B","A"])
agg_df

    COUNTRY   SOURCE     SEX  AGE  PRICE AGE_CAT SEGMENT
0       bra  android    male   46   59.0   41-70       A
1       usa  android    male   36   59.0   31-40       A
2       fra  android  female   24   59.0   24-30       A
3       usa      ios    male   32   54.0   31-40       A
4       deu  android  female   36   49.0   31-40       A
..      ...      ...     ...  ...    ...     ...     ...
343     usa      ios  female   38   19.0   31-40       D
344     usa      ios  female   30   19.0   24-30       D
345     can  android  female   27   19.0   24-30       D
346     fra  android    male   18   19.0    0-18       D
347     deu  android    male   26    9.0   24-30       D

[348 rows x 7 columns]

In [99]:
agg_df.groupby("SEGMENT").agg({'PRICE':[np.mean,sum,min,max]})

             PRICE
              mean          sum        min        max
SEGMENT
D        27.302596  2375.325850   9.000000  31.105263
C        32.933339  3128.667165  31.173913  34.000000
B        35.436170  2870.329792  34.185185  37.000000
A        41.434736  3521.952577  37.095238  59.000000

In [105]:
new_user="tur_android_female_31-40"
df1=pd.DataFrame(df1)

In [108]:
df1=df1.reset_index()

In [110]:
df1[df1["customers_level_based"]==new_user]

       customers_level_based      PRICE
72  tur_android_female_31-40  41.833333

In [111]:
df1[df1["customers_level_based"]=="fra_ios_female_31-40"]

   customers_level_based      PRICE
63  fra_ios_female_31-40  32.818182